USE cars;

INSERT INTO cars (mark, model, generation, `year-from`, `year-to`, `body-type`, `notice`, `volume`, `transmission`, `complectation`, `horse-power`, `engine-type`, `photo`, `logo`, `doors-count`, `seats`, `length`, `width`, `height`, `wheel-base`, `clearance`, `front-wheel-base`, `back-wheel-base`, `wheel-size`, `weight`, `gear-value`, `drive`, `max-speed`, `time-to-100`, `petrol-type`, `cylinders-value`, `valves`, `compressions`, `diametr`) VALUES
('AC', '378 GT Zagato', 'I', '2012', '2012', 'купе', Null, 6162, 'manual', Null, 442, 'petrol', '20465458', 'AC', 2, 2, 4406, 1924, 1233, 2540, Null, 1627.0, 1570.0, '275/35/R18 345/30/R19', 1195.0, 6.0, 'front-wheel', 298.0, 4.0, 'АИ-95', 8, Null, 10.7, Null),
('AC', 'Ace', Null, '1992', '2000', 'родстер', Null, 2900, 'manual', Null, 195, 'petrol', '20465585', 'AC', 2, 2, 4420, 1870, 1300, 2470, 130.0, 1590.0, 1570.0, Null, Null, 5.0, 'front-wheel', Null, 8.5, 'АИ-92', 6, 4.0, Null, Null),
('AC', 'Ace', Null, '1992', '2000', 'родстер', Null, 3000, 'manual', Null, 223, 'petrol', '20465585', 'AC', 2, 2, 4420, 1870, 1300, 2470, 130.0, 1590.0, 1570.0, Null, Null, 5.0, 'front-wheel', 240.0, 7.0, Null, 6, Null, Null, Null),
('AC', 'Ace', Null, '1992', '2000', 'родстер', Null, 3506, 'manual', Null, 354, 'petrol', '20465585', 'AC', 2, 2, 4420, 1870, 1300, 2470, 130.0, 1590.0, 1570.0, '245/40/R18 255/45/R18', 1510.0, 6.0, 'front-wheel', 250.0, 5.5, 'АИ-95', 8, 4.0, 8.0, 83.0),
('AC', 'Ace', Null, '1992', '2000', 'родстер', Null, 4601, 'manual', Null, 326, 'petrol', '20465585', 'AC', 2, 2, 4420, 1870, 1300, 2470, 130.0, 1590.0, 1570.0, '235/45/R17', 1510.0, 5.0, 'front-wheel', 250.0, 5.7, 'АИ-98', 8, 4.0, 9.85, 90.2),
('AC', 'Ace', Null, '1992', '2000', 'родстер', Null, 4942, 'auto', Null, 260, 'petrol', '20465585', 'AC', 2, 2, 4420, 1870, 1300, 2470, 130.0, 1590.0, 1570.0, '225/50/R16 235/50/R16', 1440.0, 4.0, 'front-wheel', 225.0, 6.6, 'АИ-95', 8, 2.0, 9.0, 101.6),
('AC', 'Ace', Null, '1992', '2000', 'родстер', Null, 2900, 'auto', Null, 195, 'petrol', '20465585', 'AC', 2, 2, 4420, 1870, 1300, 2470, 130.0, 1590.0, 1570.0, Null, Null, 4.0, 'front-wheel', Null, 9.0, 'АИ-92', 6, 4.0, Null, Null),
('AC', 'Aceca', Null, '1998', '2000', 'купе', Null, 3506, 'manual', Null, 354, 'petrol', '20465712', 'AC', 2, 2, 4660, 1890, 1340, 2720, Null, 1590.0, 1570.0, '255/45/R18', 1615.0, 6.0, 'front-wheel', 250.0, 5.6, 'АИ-95', 8, 4.0, 8.0, 83.0),
('AC', 'Aceca', Null, '1998', '2000', 'купе', Null, 4601, 'manual', Null, 326, 'petrol', '20465712', 'AC', 2, 2, 4660, 1890, 1340, 2720, Null, 1590.0, 1570.0, '255/55/R18', 1615.0, 5.0, 'front-wheel', 250.0, 6.1, 'АИ-98', 8, 4.0, 9.85, 90.2),
('AC', 'Cobra', 'Mk VI', '2013', '2015', 'родстер', Null, 6162, 'manual', Null, 437, 'petrol', '20465600', 'AC', 2, 2, 4020, 1830, 1130, 2320, 127.0, 1400.0, 1470.0, '235/40/R18 295/35/R18', 1050.0, 6.0, 'front-wheel', 278.0, 3.7, 'АИ-95', 8, 2.0, 10.7, 103.25),
('AC', 'Cobra', 'Mk VI', '2013', '2015', 'родстер', Null, 7200, 'manual', Null, 640, 'petrol', '20465600', 'AC', 2, 2, 4020, 1830, 1130, 2320, 127.0, 1400.0, 1470.0, '245/35/R19 335/30/R19', 1050.0, 6.0, 'front-wheel', 289.0, 3.2, 'АИ-95', 8, Null, Null, Null),
('AC', 'Cobra', 'Mk VI', '2013', '2015', 'родстер', Null, 6162, 'manual', Null, 647, 'petrol', '20465600', 'AC', 2, 2, 4020, 1830, 1130, 2320, 127.0, 1400.0, 1470.0, '245/35/R19 335/30/R19', 1080.0, 6.0, 'front-wheel', 305.0, 3.3, 'АИ-98', 8, Null, Null, Null),
('AC', 'Cobra', 'Mk VI', '2013', '2015', 'родстер', Null, 6162, 'manual', Null, 780, 'petrol', '20465600', 'AC', 2, 2, 4020, 1830, 1130, 2320, 127.0, 1400.0, 1470.0, '255/35/R19 345/30/R19', 1050.0, 6.0, 'front-wheel', 332.0, 2.8, 'АИ-98', 8, Null, Null, Null),
('AC', 'Cobra', 'Mk V', '1999', '2007', 'родстер', Null, 4942, 'manual', Null, 340, 'petrol', '20465456', 'AC', 2, 2, 4200, 1746, 1200, 2285, 127.0, 1420.0, 1485.0, '225/65/R15', 980.0, 5.0, 'front-wheel', 250.0, 5.3, 'АИ-95', 8, 2.0, 9.0, 101.6),
('AC', 'Cobra', 'Mk V', '1999', '2007', 'родстер', Null, 4942, 'manual', Null, 370, 'petrol', '20465456', 'AC', 2, 2, 4200, 1746, 1200, 2285, 127.0, 1420.0, 1485.0, '225/65/R15', 900.0, 6.0, 'front-wheel', 250.0, 5.3, 'АИ-95', 8, 2.0, 9.2, 101.6),
('AC', 'Cobra', 'Mk IV', '1990', '2001', 'родстер', Null, 4942, 'manual', Null, 250, 'petrol', '20465465', 'AC', 2, 2, 4115, 1735, 1245, 2285, 127.0, 1420.0, 1520.0, '225/65/R15', 980.0, 5.0, 'front-wheel', 250.0, 5.2, 'АИ-95', 8, 2.0, 9.2, 101.6),
('AC', 'Cobra', 'Mk IV', '1990', '2001', 'родстер', Null, 4942, 'manual', Null, 228, 'petrol', '20465465', 'AC', 2, 2, 4115, 1735, 1245, 2285, 127.0, 1420.0, 1520.0, '225/60/R16', 1155.0, 5.0, 'front-wheel', 215.0, 5.2, 'АИ-95', 8, 2.0, 9.7, 101.6),
('AC', 'Cobra', 'Mk IV', '1990', '2001', 'родстер', Null, 4942, 'manual', Null, 340, 'petrol', '20465465', 'AC', 2, 2, 4115, 1735, 1245, 2285, 127.0, 1420.0, 1520.0, '225/60/R16 255/60/R16', 1065.0, 5.0, 'front-wheel', 225.0, 5.0, 'АИ-95', 8, 2.0, 9.0, 101.6),
('AC', 'Cobra', 'Mk IV', '1990', '2001', 'родстер', Null, 4942, 'manual', Null, 326, 'petrol', '20465465', 'AC', 2, 2, 4115, 1735, 1245, 2285, 127.0, 1420.0, 1520.0, '225/50/R16 255/50/R16', 1160.0, 5.0, 'front-wheel', 250.0, 4.2, 'АИ-95', 8, 2.0, 9.0, 101.6),
('AC', 'Cobra', 'Mk IV', '1990', '2001', 'родстер', Null, 4942, 'manual', Null, 370, 'petrol', '20465465', 'AC', 2, 2, 4115, 1735, 1245, 2285, 127.0, 1420.0, 1520.0, '225/65/R15', 980.0, 5.0, 'front-wheel', 215.0, 5.2, 'АИ-95', 8, 2.0, 9.2, 101.6),
('AC', 'Cobra', 'Mk IV', '1990', '2001', 'родстер', Null, 6997, 'manual', Null, 425, 'petrol', '20465465', 'AC', 2, 2, 4115, 1735, 1245, 2285, Null, 1420.0, 1520.0, Null, Null, 4.0, 'front-wheel', 265.0, 4.7, 'АИ-92', 8, 2.0, 11.5, 107.7);



INSERT INTO clients (firstname, lastname, `number`, mail, birthday, passport) VALUES
('Adam', 'Jenkins', '82682757844', 'someuser@gmail.com', '1994-07-09', '7838070078'),
('Timothy', 'Sims', '84431070942', 'someuse.r@gmail.com', '1981-10-26', '3969968214'),
('Emily', 'Thompson', '89624073924', 'someus.er@gmail.com', '1971-05-03', '5244731073'),
('Mary', 'Hunt', '87488505495', 'someus.e.r@gmail.com', '1971-10-25', '0608488718'),
('David', 'Thomas', '81205395283', 'someu.ser@gmail.com', '1976-02-23', '2674727893'),
('Judy', 'Murphy', '80481955498', 'omeu.ser@gmail.com', '1978-10-25', '9782191547'),
('Nicholas', 'Miller', '83583330133', 'someu.se.r@gmail.com', '1984-11-24', '0961101136'),
('George', 'Powell', '86675255210', 'meu.ser@gmail.com', '1991-04-30', '4778874127'),
('Patricia', 'Hill', '85205870686', 'meu.ser@gmail.com', '1987-10-19', '7223183172'),
('Anna', 'Carpenter', '81059713194', 'someu.s.e.r@gmail.com', '1985-03-13', '4512398821'),
('Mark', 'Price', '88177174254', 'some.user@gmail.com', '1981-11-19', '7820520503'),
('Margaret', 'Hall', '80599020386', 'some.use.r@gmail.com', '1990-05-17', '5870424595'),
('Alberto', 'Brooks', '89853373376', 'some.us.er@gmail.com', '1980-09-30', '3373463915'),
('Michelle', 'Castillo', '89682726964', 'some.us.e.r@gmail.com', '1982-10-18', '3710915035'),
('Teresa', 'Roberts', '82974594989', 'some.u.ser@gmail.com', '1988-04-18', '6279623440'),
('Sonia', 'Hall', '84969323248', 'some.u.se.r@gmail.com', '1978-03-20', '5644126059'),
('Brian', 'Dunn', '82144688367', 'some.u.s.er@gmail.com', '1992-08-27', '1085419022'),
('Jenny', 'Reyes', '83263676569', 'some.u.s.e.r@gmail.com', '1985-06-29', '0661386046'),
('Sidney', 'Joseph','89345659234', 'som.euser@gmail.com', '1996-10-13', '4531376379');



INSERT INTO price_list VALUES
(20, 'cash', 2497000),
(21, 'cash', 2877500),
(14, 'cash', 2137500),
(13, 'all sum', 2319967),
(9, 'all sum', 1451295),
(9, 'installments', 2955200),
(10, 'installments', 1439700),
(9, 'cash', 2533300),
(9, 'rental', 2806600),
(14, 'installments', 3685900),
(1, 'cash', 3157200),
(12, 'all sum', 2195985),
(17, 'installments', 2251400),
(19, 'cash', 3076000),
(11, 'rental', 3939900);



INSERT INTO orders VALUES
(18, 14, 2146100, 'rental'),
(7, 17, 3278100, 'installments'),
(2, 21, 2908000, 'all sum'),
(9, 8, 3000600, 'installments'),
(9, 19, 2019300, 'all sum'),
(1, 10, 1523800, 'cash'),
(15, 15, 1305400, 'all sum'),
(16, 20, 1293400, 'all sum'),
(18, 9, 3075700, 'cash'),
(11, 21, 1890100, 'installments'),
(11, 16, 2539400, 'rental'),
(17, 16, 3901200, 'rental'),
(10, 18, 3756500, 'cash'),
(9, 3, 2788100, 'installments'),
(13, 2, 1865600, 'cash');



INSERT INTO club_members (firstname, lastname, phone, birthday) VALUES
('Adam', 'Jenkins', '82682757844', '1994-07-09'), 
('Timothy', 'Sims', '84431070942', '1981-10-26'), 
('Emily', 'Thompson', '89624073924', '1971-05-03'), 
('Mary', 'Hunt', '87488505495', '1971-10-25'), 
('David', 'Thomas', '81205395283', '1976-02-23'), 
('Judy', 'Murphy', '80481955498', '1978-10-25'), 
('Nicholas', 'Miller', '83583330133', '1984-11-24'), 
('George', 'Powell', '86675255210', '1991-04-30'), 
('Patricia', 'Hill', '85205870686', '1987-10-19'), 
('Anna', 'Carpenter', '81059713194', '1985-03-13'), 
('Mark', 'Price', '88177174254', '1981-11-19'), 
('Margaret', 'Hall', '80599020386', '1990-05-17'), 
('Alberto', 'Brooks', '89853373376', '1980-09-30'), 
('Michelle', 'Castillo', '89682726964', '1982-10-18'), 
('Teresa', 'Roberts', '82974594989', '1988-04-18'), 
('Sonia', 'Hall', '84969323248', '1978-03-20'), 
('Brian', 'Dunn', '82144688367', '1992-08-27'), 
('Jenny', 'Reyes', '83263676569', '1985-06-29'), 
('Sidney', 'Joseph','89345659234', '1996-10-13');



INSERT INTO applications (firstname, lastname, phone, birthday, application_status) VALUES
('John', 'Taylor', '89266125375', '1965-05-23', 'rejected'),
('Richard', 'Gibson', '82976368047', '1968-06-30', 'rejected'),
('Jonathan', 'Thomas', '83019230540', '1992-02-29', 'under consideration'),
('Mark', 'Schwartz', '86649574442', '1980-06-20', 'rejected'),
('Jason', 'Bell', '85274534851', '1969-01-16', 'rejected'),
('Nicholas', 'Becker', '82298865086', '1997-09-10', 'rejected'),
('Jack', 'Craig', '84408055138', '1983-06-20', 'under consideration'),
('Leslie', 'Robbins', '81655063666', '1975-07-17', 'under consideration'),
('Robert', 'Jones', '86001586464', '1979-05-28', 'rejected'),
('Carlos', 'Anderson', '89237472231', '1968-03-06', 'under consideration');



INSERT INTO auctions (start_date, end_date, theme) VALUES
('2021-02-20', '2021-03-25', 'Подготовка к весне'),
('2021-05-15', '2021-05-20', 'Летние забеги'),
('2021-08-10', '2021-08-20', 'Распродажа на август'),
('2021-09-22', '2021-09-22', 'Без темы'),
('2021-12-25', '2022-01-05', 'Машины для каждого года'),
('2021-02-10', '2022-02-20', 'Подготовка к весне');



INSERT INTO auction_visitors VALUES
(1, 1), (1, 4), (1, 7), (1, 8), (1, 11), (1, 12), (1, 13), (1, 15), (1, 16),
(2, 1), (2, 3), (2, 7), (2, 8), (2, 9), (2, 11), (2, 12), (2, 13), (2, 16), (2, 17), (2, 18),
(3, 1), (3, 5), (3, 6), (3, 7), (3, 8), (3, 12), (3, 13), (3, 16), (3, 18),
(4, 4), (4, 6), (4, 7), (4, 10), (4, 12), (4, 13), (4, 15), (4, 16), (4, 17), (4, 18),
(5, 1), (5, 5), (5, 6), (5, 7), (5, 9), (5, 10), (5, 12), (5, 13), (5, 17),
(6, 2), (6, 4), (6, 5), (6, 7), (6, 8), (6, 9), (6, 11), (6, 14), (6, 15), (6, 17), (6, 18);



INSERT INTO events (start_date, end_date, theme) VALUES
('2021-01-21', '2021-01-25', 'Январский отпуск'),
('2021-03-10', '2021-03-15', 'О весне'),
('2021-06-01', '2021-06-15', 'Итальянская выстовка классических родстеров'),
('2021-09-21', '2021-09-25', 'Машины для начала года (выставка)'),
('2022-01-20', '2022-01-25', 'Январский отпуск'),
('2022-03-10', '2022-03-20', 'Весна в Париже (выставка французских спорткаров)'),
('2022-05-01', '2022-05-20', 'Начало лето - время Итальянской классики');



INSERT INTO event_visitors VALUES
(1, 2), (1, 5), (1, 6), (1, 7), (1, 8), (1, 9), (1, 11), (1, 12), (1, 14), (1, 18),
(2, 1), (2, 4), (2, 7), (2, 8), (2, 9), (2, 13), (2, 15), (2, 17),
(3, 1), (3, 2), (3, 3), (3, 4), (3, 7), (3, 8), (3, 10), (3, 11), (3, 16), (3, 18),
(4, 3), (4, 5), (4, 7), (4, 8), (4, 10), (4, 11), (4, 13), (4, 15), (4, 16), (4, 17),
(5, 3), (5, 4), (5, 5), (5, 7), (5, 9), (5, 11), (5, 12), (5, 14), (5, 16), (5, 17), (5, 18),
(6, 1), (6, 2), (6, 3), (6, 4), (6, 5), (6, 8), (6, 9), (6, 11), (6, 12), (6, 15), (6, 18),
(7, 3), (7, 4), (7, 5), (7, 7), (7, 10), (7, 12), (7, 14), (7, 15), (7, 16), (7, 17);



